In [1]:
import pandas as pd

Data analysis
1. description
2. diagnosis
3. Prediction
4. prescriptions/actions

In [2]:
# COLUMN NAMES
cols= ['user_id','movie_id','rating','ts']

In [3]:
# READ THE FILE
df=pd.read_csv('u.data', sep='\t', names=cols)

In [4]:
item_cols=['movie_id','title']+[str(i) for i in range(22)]

In [5]:
# READ ANOTHER FILE
df1=pd.read_csv('u.item', sep='|',encoding="ISO-8859-1",names=item_cols)[['movie_id','title']]

In [6]:
df1.shape

(1682, 2)

In [7]:
df1.sample(3)

      movie_id                         title
1343      1344  Story of Xinghua, The (1993)
1494      1495                  Flirt (1995)
530        531                  Shine (1996)

#EXPLORATORY DATA ANALYSIS (EDA)

In [8]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [9]:
df.sample(5)

       user_id  movie_id  rating         ts
72191      321       435       5  879439860
11545      148       509       5  877016605
72060      378        55       4  880046229
51686      581      1375       5  879641787
96995      932       399       4  891251798

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [11]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

In [12]:
# Types of data
# 1/2.string data : categorical/ random
# 3/4. numerical data :quantified/ categorical
# 5. Random numbers or IDs

In [13]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [14]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [15]:
df['rating'].nunique()

5

In [16]:
df['user_id'].nunique()

944

In [17]:
df['movie_id'].nunique()

1682

In [18]:
# Merging the dataframes

In [19]:
movie= pd.merge(df,df1, on='movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [20]:
# Remove the useless columns i.e ts

In [21]:
movie.drop('ts', axis=1, inplace=True)

In [22]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [23]:
# number of ratings for each movie

In [24]:
movie['title'].value_counts().head()

Star Wars (1977)             584
Contact (1997)               509
Fargo (1996)                 508
Return of the Jedi (1983)    507
Liar Liar (1997)             485
Name: title, dtype: int64

In [25]:
# average rating for each movie

In [26]:
movie.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64

In [27]:
# combine above 2 data

In [28]:
ratings=pd.DataFrame(movie.groupby('title')['rating'].mean().sort_values(ascending=False))

In [29]:
ratings.head()

                                            rating
title
They Made Me a Criminal (1939)                 5.0
Marlene Dietrich: Shadow and Light (1996)      5.0
Saint of Fort Washington, The (1993)           5.0
Someone Else's America (1995)                  5.0
Star Kid (1997)                                5.0

In [30]:
ratings['count']= movie['title'].value_counts()

ratings.head(20)

In [31]:
ratings.sort_values(by='count',ascending=False).head(20)

                                    rating  count
title
Star Wars (1977)                  4.359589    584
Contact (1997)                    3.803536    509
Fargo (1996)                      4.155512    508
Return of the Jedi (1983)         4.007890    507
Liar Liar (1997)                  3.156701    485
English Patient, The (1996)       3.656965    481
Scream (1996)                     3.441423    478
Toy Story (1995)                  3.878319    452
Air Force One (1997)              3.631090    431
Independence Day (ID4) (1996)     3.438228    429
Raiders of the Lost Ark (1981)    4.252381    420
Godfather, The (1972)             4.283293    413
Pulp Fiction (1994)               4.060914    394
Twelve Monkeys (1995)             3.798469    392
Silence of the Lambs, The (1991)  4.289744    390
Jerry Maguire (1996)              3.710938    384
Chasing Amy (1997)                3.839050    379
Rock, The (1996)                  3.693122    378
Empire Strikes Back, The (1980)   4.206522    368
Star Trek: First Contact (1996)   3.660274    365

In [32]:
type(movie)

pandas.core.frame.DataFrame

In [33]:
movie_pivot = movie.pivot_table(index='user_id', columns='title',values='rating')
movie_pivot.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [34]:
movie_selected='Star Wars (1977)'

In [35]:
import warnings
warnings.filterwarnings('ignore')

In [36]:
ms_rates=movie_pivot[movie_selected]
ms_rates.head()

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

In [37]:
corrs=movie_pivot.corrwith(ms_rates).sort_values(ascending=False)
corrs.head(20)

title
Commandments (1997)                                                                  1.0
Cosi (1996)                                                                          1.0
No Escape (1994)                                                                     1.0
Stripes (1981)                                                                       1.0
Man of the Year (1995)                                                               1.0
Hollow Reed (1996)                                                                   1.0
Beans of Egypt, Maine, The (1994)                                                    1.0
Good Man in Africa, A (1994)                                                         1.0
Old Lady Who Walked in the Sea, The (Vieille qui marchait dans la mer, La) (1991)    1.0
Outlaw, The (1943)                                                                   1.0
Line King: Al Hirschfeld, The (1996)                                                 1.0
Hurricane Streets (1998)                                                             1.0
Scarlet Letter, The (1926)                                                           1.0
Safe Passage (1994)                                                                  1.0
Star Wars (1977)                                                                     1.0
Golden Earrings (1947)                                                               1.0
Full Speed (1996)                                                                    1.0
Twisted (1996)                                                                       1.0
Ed's Next Move (1996)                                                                1.0
Mondo (1996)                                                                         1.0
dtype: float64

In [39]:
corrs_df=pd.DataFrame(corrs,columns=['Correlation'])
corrs_df.head()

                        Correlation
title
Commandments (1997)             1.0
Cosi (1996)                     1.0
No Escape (1994)                1.0
Stripes (1981)                  1.0
Man of the Year (1995)          1.0

In [41]:
corrs_df['rating']=ratings['rating']
corrs_df['count']=ratings['count']

In [42]:
corrs_df.head()

                        Correlation    rating  count
title
Commandments (1997)             1.0  2.666667      3
Cosi (1996)                     1.0  4.000000      4
No Escape (1994)                1.0  2.400000      5
Stripes (1981)                  1.0  3.800000      5
Man of the Year (1995)          1.0  3.111111      9

In [46]:
corrs_df[corrs_df['count']>50].sort_values(by='Correlation',ascending=False).head(10)

,Correlation,rating,count
title,,,
Star Wars (1977),1.000000,4.359589,584
"Empire Strikes Back, The (1980)",0.748353,4.206522,368
Return of the Jedi (1983),0.672556,4.007890,507
Raiders of the Lost Ark (1981),0.536117,4.252381,420
Giant (1956),0.488093,3.745098,51
"Life Less Ordinary, A (1997)",0.411638,3.075472,53
Austin Powers: International Man of Mystery (1997),0.377433,3.246154,130
"Sting, The (1973)",0.367538,4.058091,241
Indiana Jones and the Last Crusade (1989),0.350107,3.930514,331
Pinocchio (1940),0.347868,3.673267,101

In [54]:
top_recom= list(corrs_df[corrs_df['count']>50]\
                .sort_values(by='Correlation', ascending=False).head(3).index)

In [52]:
top_recom.remove(movie_selected)

In [53]:
top_recom

['Empire Strikes Back, The (1980)', 'Return of the Jedi (1983)']

In [ ]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

def movie_recommend(movie_selected='Star Wars (1977)'):
    #read files
    cols= ['user_id','movie_id','rating','ts']
    df=pd.read_csv('u.data', sep='\t', names=cols).drop('ts', axis=1, inplace=True)
    item_cols=['movie_id','title']+[str(i) for i in range(22)]
    df1=pd.read_csv('u.item', sep='|',encoding="ISO-8859-1",names=item_cols)[['movie_id','title']]
    
    # merge the dataframes
    movie= pd.merge(df,df1, on='movie_id')
    
    #create pivot table
    movie_pivot = movie.pivot_table(index='user_id', columns='title',values='rating')
    
    #find similarity for selected movie
    corrs=movie_pivot.corrwith(movie_pivot[movie_selected])
    corrs_df=pd.DataFrame(corrs,columns=['Correlation'])
    corrs_df['rating']=movie.groupby('title')['rating'].mean().sort_values(ascending=False)
    corrs_df['count']=ratings['count']